# 网络实验考试报告

42 组

组长：

游莫凡 201250073

组员：

陈子凡 201250072

郁博文 201250070

邢佳勇 201250071

郑啓睿 201250229

## 实验要求

1. 拓扑需使用动态路由协议。  
2. 拓扑中需包含VLAN及trunk技术。  
3. 拓扑至少需包含设备：2台交换机、4台路由器、4台PC。

## 实验技术

1. VLAN
2. trunk
3. RIP（动态）
4. ACL
5. NAT（静态）

## 实验拓扑

ps:实验拓扑通过packet tracer绘制，并未引入设置，仅做展示使用，图示如下：

![实验拓扑](C:\Users\86199\Desktop\classoffour\course-document-s22\计网\实验\大实验\实验拓扑.png)

(1) R0、PC0、PC3属于VLAN10

(2) R2、PC1、PC2属于VLAN20

(3) 配置路由器、PC、Server的端口地址，配置表如下：

| 设备名称 | 端口   | 地址         | 网关         | 内网地址  |
| -------- | ------ | ------------ | ------------ | --------- |
| R0       | S      | 192.168.2.1  |              |           |
| R0       | g1/0/1 | 192.168.1.1  |              |           |
| R1       | S      | 192.168.2.2  |              |           |
| R1       | S      | 192.168.3.1  |              |           |
| R2       | S      | 192.168.3.2  |              |           |
| R2       | S      | 202.0.1.2    |              |           |
| R2       | g1/0/1 | 192.168.4.1  |              |           |
| R3       | S      | 202.0.1.1    |              |           |
| R3       | g1/0/1 | 192.168.10.1 |              |           |
| PC4      | F      | 192.168.10.2 | 192.168.10.1 | 202.0.1.3 |
| PC0      | F      | 192.168.1.2  | 192.168.1.1  |           |
| PC1      | F      | 192.168.4.2  | 192.168.4.1  |           |
| PC2      | F      | 192.168.4.3  | 192.168.4.1  |           |
| PC3      | F      | 192.168.1.3  | 192.168.1.1  |           |



## 实验过程

1. 绘制实验拓扑并配置各端口ip地址，见实验拓扑的图和表

2. 配置动态路由协议

   - R0
     Router>en

     Router#conf t

     Router (config)# int g1/0/1

     Router (config-if)# ip address 192.168.1.1 255.255.255.0

     Router (config-if)#no shut

     Router (config)# int s0/0/0

     Router (config-if)# ip address 192.168.2.1 255.255.255.0

     Router (config-if)#clock rate 64000

     Router (config-if)#no shut

     Router (config)#router rip

     Router (config-router)#network 192.168.1.0

     Router (config-router)#network 192.168.2.0

     Router (config-router)#end

   - R1

     Router>en

     Router#conf t

     Router (config)# int s0/1/0

     Router (config-if)# ip address 192.168.2.2 255.255.255.0

     Router (config-if)#clock rate 64000

     Router (config-if)#no shut

     Router (config)# int s0/0/0

     Router (config-if)# ip address 192.168.3.1 255.255.255.0

     Router (config-if)#clock rate 64000

     Router (config-if)#no shut

     Router (config)#router rip

     Router (config-router)#network 192.168.2.0

     Router (config-router)#network 192.168.3.0

     Router (config-router)#end

   - R2

     Router>en

     Router#conf t

     Router (config)# int g1/0/1

     Router (config-if)# ip address 192.168.4.1 255.255.255.0

     Router (config-if)#no shut

     Router (config)# int s0/1/0

     Router (config-if)# ip address 192.168.3.2 255.255.255.0

     Router (config-if)#clock rate 64000

     Router (config-if)#no shut

     Router (config)# int s0/0/0

     Router (config-if)# ip address 202.0.1.2 255.255.255.0

     Router (config-if)#clock rate 64000

     Router (config-if)#no shut

     Router (config)#router rip

     Router (config-router)#network 192.168.3.0

     Router (config-router)#network 192.168.4.0

     Router (config-router)#network 202.0.1.0

     Router (config-router)#end

   - R3

     Router>en

     Router#conf t

     Router (config)# int g1/0/1

     Router (config-if)# ip address 192.168.10.1 255.255.255.0

     Router (config-if)#no shut

     Router (config)# int s0/0/0

     Router (config-if)# ip address 202.0.1.1 255.255.255.0

     Router (config-if)#clock rate 64000

     Router (config-if)#no shut

     Router (config)#router rip

     Router (config-router)#network 192.168.10.0

     Router (config-router)#network 202.0.1.0

     Router (config-router)#end

3. 划分VLAN并设置trunk链路

   - 设置两台交换机所需要的划分的VLAN域名

     在两台交换机的config模式下输入

     vlan 10

     vlan 20

   - 将两台交换机连接的链路（端口都是g1/0/1）设置为trunk链路

     Switch(config)#int g1/0/1

     Switch(config-if)#switchport mode trunk

   - 将交换机上的端口映射到对应的VLAN上

     - switch0

       Switch(config)# int g1/0/2

       Switch(config-if)#switchport mode access

       Switch(config-if)#switchport access vlan 10

       Switch(config-if)#exit

       Switch(config)#int g1/0/3

       Switch(config-if)#switchport mode access

       Switch(config-if)#switchport access vlan 10

       Switch(config-if)#exit

       Switch(config)#int g1/0/4

       Switch(config-if)#switchport mode access

       Switch(config-if)#switchport access vlan 20

       Switch(config-if)#end

     - switch1

       Switch(config)# int g1/0/2

       Switch(config-if)#switchport mode access

       Switch(config-if)#switchport access vlan 20

       Switch(config-if)#exit

       Switch(config)#int g1/0/3

       Switch(config-if)#switchport mode access

       Switch(config-if)#switchport access vlan 10

       Switch(config-if)#exit

       Switch(config)#int g1/0/4

       Switch(config-if)#switchport mode access

       Switch(config-if)#switchport access vlan 20

       Switch(config-if)#end

4. 配置NAT

   - 在R3上配置内网与外网的接口

     Router (config)# int g1/0/1

     Router (config-if)#ip nat inside

     Router (config-if)#exit

     Router (config)#  int s0/0/0

     Router (config-if)# ip nat outside

     Router (config-if)#exit

   - 配置静态NAT

     Router (config)#ip nat inside source static 192.168.10.2 202.0.1.3

     Router (config)#end

   - 查看NAT映射表

     Router# show ip nat translations

     *留待明日截图*

5. 配置ACL

   - 设置禁止PC0向PC2发送icmp报文的ACL

     Router (config)#access-list 101 deny icmp host 192.168.1.2 host 192.168.4.3

     Router (config)#access-list 101 permit ip any any

     Router (config)#int g1/0/1

     Router (config)#ip access-group 101 in

     

## 实验结果

留待明日补图

- RIP
- VLAN
- ACL
- NAT



